package samanpayment

var codes = map[int]string{
	1:    "تراکنش توسط خریدار کنسل شده است.",
	2:    "پرداخت با موفقیت انجام شده است.",
	3:    "پرداخت انجام نشد.",
	4:    "کاربر در بازه زمانی تعیین شده پاسخی ارسال نکرده است.",
	5:    "پارامتر های ارسالی نامعتبر است.",
	8:    "آدرس سرور پذیرنده نامعتبر است.",
	10:   "توکن ارسال شده یافت نشد.",
	11:   "با این شماره ترمینال فقط تراکنش های توکنی قابل پرداخت هستند.",
	12:   "شماره ترمینال ارسال شده یافت نشد.",
	-100: "لطفا ورودی متد را کنترل نمائید.",
	-101: "مدل ورودی دارای پارامترهای نامعتبر است.",
	-102: "پردازش درخواست با خطا مواجه گردید.",
	-103: "پاسخی از سرور دریافت نشد.",
	-104: "ترمینال ارسالی غیرفعال می باشد.",
	-105: "ترمینال ارسالی در سیستم موجود نمی باشد.",
	-106: "آدرس آیپی درخواستی غیرمجار می باشد.",
	-107: "امکان وریفای کردن تراکنش موردنظر وجود ندارد.",
	-108: "امکان وریفای سریع برای این ترمینال وجود ندارد.",
	-111: "امکان تایید تراکنش وجود ندارد.",
	-112: "امکان برگشت تراکنش وجود ندارد.",
}
